#郭嘉
#性格测试机-根据生肖返回性格评价
def character(a):
    zodiac = {
    "鼠":"嗨害!你吃软不吃硬,缺乏安全感,有些感性。在陌生人面前很冷淡,熟人面前却很闹腾,外表坚强,内心则柔软细腻。属鼠的明星有:球星詹姆斯,C罗,戚薇,赵又廷,郭德纲",
    "牛":"强迫症患者,书本必须摆放整齐,有一点孤僻,有一些恋旧,一首喜欢的歌可以听好久,虽然人群中一直嘻嘻哈哈,但其实是害怕孤独。做一只勇敢牛牛,希望你永远不怕困难! 属牛的明星有:刘德华,陈伟霆,关晓彤,王一博,刘昊然",    
    "虎":"倔强,遇到讨厌的人,宁可受罪也不向对方求助。率真坦白,讨厌被欺骗,做事缺乏耐心,心地善良而且很心软,非常乐意去帮助别人。属虎的明星有:国母彭丽媛,杨幂,吴京,蔡徐坤,周星驰",
    "兔":"外表孩子气,内心却很成熟,心里藏着许多秘密,只和最亲密的人分享。害怕被忽略,对人关心也不表露出来,情绪化。爱撒娇,超级黏人,喜欢赖床。属兔的明星有:王俊凯,赵丽颖,李易峰,刘亦菲,吴磊",    
    "龙":"霸气!控制欲强,喜欢做领导干部,日程特别爱整洁。泪腺发达,易被感动。偏执,苛求完美,是个完美主义者! 属龙的明星有:易烊千玺,王源,李小龙,新垣结衣,朱一龙",    
    "蛇":"思维独特,脑海里总有奇思妙想,但性格敏感,容易被同学不经意间的玩笑话伤害到,情绪从来不会表现在脸上,非常的冷静。死要面子爱逞强,即使伤心也不会表现出来。属蛇的明星有:任嘉伦,Angelababy,钢铁侠的演员,郭富城,泽连斯基",
    "马":"你是一个温柔的人,替他人着想,常试图改变自己迎合对方,对最亲爱的人容易发脾气,对外人却很和善。重视友情,和你成为死党可不是什么简单的事。还有,超懒散,对任何事都抱随遇而安的态度。属马的明星有:科比,周杰伦,成龙,华晨宇,鹿晗",
    "羊":"你比较善忘,不论多重要的事都容易忘记,不记仇。黑白分明,喜欢被肯定和信任,讨厌耍心机,玩心重。热爱自由,讨厌被束缚压迫。喜欢挑战别人做不到的事。属羊的明星有:肖战,张艺兴,谷爱凌,杨洋,邓紫棋",    
    "猴":"你天生机灵,比较贪玩,而且很早熟。你聪明伶俐,头脑反应灵活,风趣幽默,经常能给身边的人带去欢乐。希望你永远是一个快快乐乐无忧无虑的行者孙呀! 属猴的明星有:迪丽热巴,张国荣,邓伦,杨紫,古力娜扎",    
    "鸡":"有魅力,个性张扬或内敛都对旁人很有吸引力。记仇,别轻易得罪,生气的时候不会大发雷霆,但是沉默才看起来更可怕,你是一个神秘,有魅力,周围永远不缺朋友的人。属鸡的明星有:黄子韬,白敬亭,赵本山,林俊杰,郭艾伦",  
    "狗":"喜欢简单,不喜欢麻烦和累的感觉。健忘不记仇,大大咧咧的,有斗志爱拼搏,刻苦努力。别人对你好定加倍奉还,天生的统筹规划专家，计划性强。固执,明知是错也要往前走,撞了南墙就把墙拆了继续走。属狗的明星有:彭于晏,王宝强,王凯,迈克尔杰克逊,贾斯汀比伯",
    "猪":"聪明,智商高,但是很懒,很怕麻烦。遇事沉着冷静,总会在最短的时间内想出解决方案,把事情交给你做往往很放心,而且你会做的特别出色,所以非常受大家的青睐！属猪的明星有:佟丽娅,薛之谦,汪峰,六小龄童,林丹"    
    }
    return zodiac[a]


#开心三子棋-更新棋盘
def updateChess(chessList):
    print(chessList[1], chessList[2], chessList[3])
    print(chessList[4], chessList[5], chessList[6])
    print(chessList[7], chessList[8], chessList[9])
    if updateChessWin(chessList, 1, 2, 3) == "y" or updateChessWin(chessList, 4, 5, 6) == "y" or updateChessWin(chessList, 7, 8, 9) == "y":
        print("游戏结束")
        exit()
    if updateChessWin(chessList, 1, 4, 7) == "y" or updateChessWin(chessList, 2, 5, 8) == "y" or updateChessWin(chessList, 3, 6, 9) == "y":
        print("游戏结束")
        exit()
    if updateChessWin(chessList, 1, 5, 9) == "y" or updateChessWin(chessList, 3, 5, 7) == "y":
        print("游戏结束")
        exit()

#开心三子棋-判断胜利与否
def updateChessWin(chessList, n1, n2, n3):
    if chessList[n1] == chessList[n2] and chessList[n2] == chessList[n3] and chessList[n3] != "-":
        return "y"
    else:
        return "n"